brew "fastfetch"
brew "fzf"
brew "git"
brew "lazygit"
brew "neovim"
brew "pyenv"
brew "starship"
brew "stow"
brew "xz"
cask "brave-browser"
cask "ghostty"
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"
cask "raycast"
cask "signal"
