tap "modem-dev/tap"
tap "nikitabobko/tap"
tap "theboredteam/boring-notch", "https://github.com/TheBoredTeam/homebrew-boring-notch"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Python version management
brew "pyenv"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# General-purpose data compression with high compression ratio
brew "xz"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Desktop-inspired terminal diff viewer for agent-authored changesets
brew "modem-dev/tap/hunk", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Not so boring notch That Rocks 🎸🎶 
cask "theboredteam/boring-notch/boring-notch", trusted: true
# Web browser focusing on privacy
cask "brave-browser"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# VPN client focusing on security
cask "protonvpn"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
npm "corepack"
